---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TrussNonBearingOffsetParam
source: html/a6e122e9-0be7-b391-a596-a3bb6aec38d5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TrussNonBearingOffsetParam Property

"Non Bearing Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId TrussNonBearingOffsetParam { get; }
```